//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"BUILDING_ENTITY_STORE"="단계 %d/%d’ 수행 중: 엔티티 저장소를 작성하고 있습니다.";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"CREATING_BOOTSTRAP_DATABASE"="단계 %d/%d’ 수행 중: 부트스트랩 데이터베이스를 생성하고 있습니다.";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"CREATING_REQUEST_QUEUE_DATABASE"="단계 %d/%d’ 수행 중: 요청 대기열 데이터베이스를 생성하고 있습니다.";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps. 1st %s - received bytes; 2nd %s - total bytes.
"DOWNLOADING_ENTITY_STORE"="단계 %d/%d’ 수행 중: 엔티티 저장소를 다운로드하고 있습니다. 지금까지 %s/%s’ 바이트가 수신되었습니다.";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"ERASING_EXPIRED_REQUESTS"="단계 %d/%d’ 수행 중: 만료된 요청을 지우고 있습니다.";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"LOADING_METADATA"="단계 %d/%d’ 수행 중: 메타데이터를 로드하고 있습니다.";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"PERFORMING_REQUEST_QUEUE_MERGE"="단계 %d/%d’ 수행 중: 요청 대기열 병합을 수행하고 있습니다.";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"PERFORMING_TRANSACTION_MERGE"="단계 %d/%d’ 수행 중: 트랜잭션 병합을 수행하고 있습니다.";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"PERFORMING_CREATE_DELETE_MERGE"="단계 %d/%d’ 수행 중: 생성-삭제 병합을 수행하고 있습니다.";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps. 1st %s - request name; 2nd %s - request url.
"PROCESSING_DEFINING_QUERIES"="단계 %d/%d’ 수행 중: 쿼리 %s 정의를 처리하고 있습니다(%s’ 사용).";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps. 1st %s - request number; 2nd %s - total request number.
"PROCESSING_REQUESTS"="단계 %d/%d’ 수행 중: 요청을 처리하고 있습니다. 수정 요청 %s/%s을(를) 보내고 있습니다.";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"REAPPLYING_CHANGES"="단계 %d/%d’ 수행 중: 변경사항을 다시 적용하고 있습니다.";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"ANALYZING_RECEIVED_DATA"="단계 %d/%d’ 수행 중: 수신된 데이터를 분석하고 있습니다.";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps. %s - received bytes.
"RECEIVING_DATA_FROM_SERVER"="단계 %d/%d’ 수행 중: 서버에서 데이터를 수신하고 있습니다. 지금까지 %s’ 바이트가 수신되었습니다.";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"REMOVING_DELETED_RELATIONSHIPS"="단계 %d/%d’ 수행 중: 삭제된 관계를 제거하고 있습니다.";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps. Removing requests that have a custom http header "REMOVE_AFTER_UPLOAD". Note: the header name is a constant, please do not translate.
"REMOVING_REMOVEAFTERUPLOAD_REQUESTS"="단계 %d/%d’ 수행 중: RemoveAfterUpload로 지정된 요청을 제거하고 있습니다.";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps. %s - sent bytes.
"SENDING_DATA_TO_SERVER"="단계 %d/%d’ 수행 중: 데이터를 서버로 보내고 있습니다. 지금까지 %s’ 바이트가 전송되었습니다.";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps. 1st %s - sent bytes; 2nd %s - total bytes.
"SENDING_ENTITY_STORE_DATABASE"="단계 %d/%d’ 수행 중: 엔티티 저장소 데이터베이스를 보내고 있습니다. 지금까지 %s/%s 바이트가 전송되었습니다.";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps. 1st %s - sent bytes; 2nd %s - total bytes.
"SENDING_REQUEST_QUEUE_DATABASE"="단계 %d/%d’ 수행 중: 요청 대기열 데이터베이스를 보내고 있습니다. 지금까지 %s/%s 바이트가 전송되었습니다.";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"STARTING_COMMUNICATION_WITH_SERVER"="단계 %d/%d’ 수행 중: 서버와의 통신을 시작하고 있습니다.";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"UPLOAD_PREPROCESSING"="단계 %d/%d’ 수행 중: 업로드 전에 요청을 사전 처리하고 있습니다.";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"WAITING_FOR_DOWNLOAD"="단계 %d/%d’ 수행 중: 다운로드 대기 중입니다.";

